## **Test para las diversas funciones**

- Aqui importamos las diversas librerias necesarias y el archivo.py donde tenemos todas las funciones

In [10]:
import pandas as pd
import numpy as np
from scipy.stats import pearsonr
import sys
sys.path.append("../src")

from toolbox_ML import describe_df, tipifica_variables, get_features_num_regression

- Aqui cargamos el dataset del Titanic:

In [11]:
df_titanic = pd.read_csv(
    "../data/titanic.csv",
    sep=",",
    skip_blank_lines=True,
    on_bad_lines="skip",
    encoding="utf-8"
)

In [26]:
df_boston = pd.read_csv(
    "../data/obligatoria_hard.csv",
    sep="|",
    skip_blank_lines=True,
    on_bad_lines="skip",
    encoding="utf-8"
)

In [27]:
df_boston

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,9.67,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,7.88,11.9

In [12]:
df_titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [13]:
df_titanic["sibsp"].unique()

array([1, 0, 3, 4, 2, 5, 8])

- Aqui llamo a la funcion:

In [14]:
describe_df(df_titanic)

            DATA_TYPE  MISSINGS (%)  UNIQUE_VALUES  CARDIN (%)
fare          float64          0.00            248       27.83
age           float64         19.87             88        9.88
sibsp           int64          0.00              7        0.79
parch           int64          0.00              7        0.79
deck           object         77.22              7        0.79
embarked       object          0.22              3        0.34
pclass          int64          0.00              3        0.34
embark_town    object          0.22              3        0.34
class          object          0.00              3        0.34
who            object          0.00              3        0.34
sex            object          0.00              2        0.22
survived        int64          0.00              2        0.22
adult_male       bool          0.00              2        0.22
alive          object          0.00              2        0.22
alone            bool          0.00              2        0.22

In [15]:
tipifica_variables(df_titanic)

   nombre_variable      tipo_sugerido
0         survived            Binaria
1           pclass  Numerica Discreta
2              sex            Binaria
3              age  Numerica Continua
4            sibsp  Numerica Discreta
5            parch  Numerica Discreta
6             fare  Numerica Continua
7         embarked         Categórica
8            class         Categórica
9              who         Categórica
10      adult_male            Binaria
11            deck         Categórica
12     embark_town         Categórica
13           alive            Binaria
14           alone            Binaria

In [ ]:
get_features_num_regression(df_boston, target_col= "MEDV" , umbral_corr= 0.4)

NameError: name 'data' is not defined